/* 
==================================================================================
KART TANIMA SÖZLÜĞÜ (binary-data.js)
----------------------------------------------------------------------------------
Bu dosya ana okuyucu motorundan bağımsız olarak tüm oyun kartlarının binary 
kodlarını ve isim eşleşmelerini tutar.
==================================================================================
*/

const CARD_DATABASE = {
    "1010110100101": "Karo 9",
    "1010010010101": "Kupa 5",
    "1010010110101": "Kupa J (Vale)",
    "1010011001001": "Maça 3",
    "1010101001001": "Maça A (As)",
    "1010100110101": "Karo Q (Kız)" // Önceki testlerimizde bulduğumuz Kız kartı



//yeni eklenenler 28.08.2026
//"1010010101001": "SK",
//"1010001100011": "C9",
//"1010100101001": "S8",
//"1010101010101": "DK",
//"1010010100101": "D7",
//"1010101011001": "C4",
//"1010110010101": "H7"





};
